In [1]:
import pandas as pd

In [2]:
DataFrame = {
    "Nombres": ["Ana", "Juan", "Pedro", "Sofia", "Luis"],
    "Años": [25, 14, 28, 18, 20],
    "Ciudad": ["Barcelona", "Madrid", "Sevilla", "Valencia", "Bilbao"]
}

In [3]:
df = pd.DataFrame(DataFrame)

In [6]:
df

  Nombres  Años     Ciudad
0     Ana    25  Barcelona
1    Juan    14     Madrid
2   Pedro    28    Sevilla
3   Sofia    18   Valencia
4    Luis    20     Bilbao

In [7]:
df.to_csv("data.csv", index=False)

In [2]:
df = pd.read_csv("data.csv")

In [3]:
df

  Nombres  Años     Ciudad
0     Ana    25  Barcelona
1    Juan    14     Madrid
2   Pedro    28    Sevilla
3   Sofia    18   Valencia
4    Luis    20     Bilbao